devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(SDSPI, void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 * @param[in ]          *opened_by_task         task with opened this device (valid only if force is true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(SDSPI, void *device_handle, bool force, const task_t *opened_by_task)
{
        UNUSED_ARG(force);
        UNUSED_ARG(opened_by_task);

        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(SDSPI, void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);

        struct sdspi_data *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(hdl->card_protect_mtx, MAX_DELAY)) {
                n = card_write(hdl, src, count, *fpos);
                mutex_unlock(hdl->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(SDSPI, void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);

        struct sdspi_data *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(hdl->card_protect_mtx, MAX_DELAY)) {
                n = card_read(hdl, dst, count, *fpos);
                mutex_unlock(hdl->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(SDSPI, void *device_handle, int request, void *arg)
{
        STOP_IF(device_handle == NULL);

        struct sdspi_data *hdl = device_handle;

        stdret_t status = STD_RET_OK;

        switch (request) {
        case SDSPI_IORQ_INITIALIZE_CARD:
                if (mutex_lock(hdl->card_protect_mtx, MTX_BLOCK_TIME)) {
                        bool *result = arg;
                        *result      = false;

                        vfs_remove(SDSPI_PARTITION_1_PATH);
                        vfs_remove(SDSPI_PARTITION_2_PATH);
                        vfs_remove(SDSPI_PARTITION_3_PATH);
                        vfs_remove(SDSPI_PARTITION_4_PATH);

                        if (initialize_card(hdl) == STD_RET_OK) {
                                if (detect_partitions(hdl) == STD_RET_OK) {
                                        *result = true;
                                }
                        }

                        mutex_unlock(hdl->card_protect_mtx);
                } else {
                        errno  = EBUSY;
                        status = STD_RET_ERROR;
                }
                break;

        default:
                errno = EBADRQC;
                status = STD_RET_ERROR;
                break;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(SDSPI, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(SDSPI, void *device_handle, struct vfs_dev_stat *device_stat)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_stat == NULL);

        struct sdspi_data *hdl    = device_handle;
        stdret_t           status = STD_RET_ERROR;

        if (mutex_lock(hdl->card_protect_mtx, MTX_BLOCK_TIME_LONG)) {
                /* size info */
                if (send_cmd(hdl, CMD9, 0) == 0) {
                        u8_t    csd[16];
                        u8_t    token;
                        timer_t timer = timer_reset();

                        while ((token = spi_rw(0xFF)) == 0xFF && !timer_is_expired(timer, SDSPI_WAIT_TIMEOUT));

                        if (token == 0xFE) {
                                u8_t *ptr = &csd[0];
                                for (int i = 0; i < 4; i++) {
                                        *ptr++ = spi_rw(0xFF);
                                        *ptr++ = spi_rw(0xFF);
                                        *ptr++ = spi_rw(0xFF);
                                        *ptr++ = spi_rw(0xFF);
                                }
                                spi_rw(0xFF);
                                spi_rw(0xFF);

                                /* SDC version 2.00 */
                                device_stat->st_size = 0;
                                if ((csd[0] >> 6) == 1) {
                                        int csize            = csd[9] + ((u16_t)csd[8] << 8) + 1;
                                        device_stat->st_size = (u64_t)csize << 10;
                                } else { /* SDC version 1.XX or MMC*/
                                        int n     = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
                                        int csize = (csd[8] >> 6) + ((u16_t)csd[7] << 2) + ((u16_t)(csd[6] & 3) << 10) + 1;
                                        device_stat->st_size = (u64_t)csize << (n - 9);
                                }
                                device_stat->st_size *= SECTOR_SIZE;
                                device_stat->st_major = 0;
                                device_stat->st_minor = 0;

                                status = STD_RET_OK;
                        } else {
                                errno = EIO;
                        }
                } else {
                        errno = EIO;
                }

                mutex_unlock(hdl->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

