devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return status;
}

//==============================================================================
/**
 * @brief Function select card
 */
//==============================================================================
static void select_card(void)
{
        SDSPI_SD_SELECT;
}

//==============================================================================
/**
 * @brief Function deselect card
 */
//==============================================================================
static void deselect_card(void)
{
        SDSPI_SD_DESELECT;
}

//==============================================================================
/**
 * @brief Function open new partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in]  flags            file open flags
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_open(void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

        struct partition *hdl = device_handle;

        if (hdl->in_use == true) {
                errno = EBUSY;
                return STD_RET_ERROR;
        } else {
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Function close partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in]  forced           force close
 * @param[in] *task             task which open file, valid if forced = true
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_close(void *device_handle, bool forced, const task_t *task)
{
        UNUSED_ARG(forced);
        UNUSED_ARG(task);
        STOP_IF(device_handle == NULL);

        struct partition *hdl = device_handle;

        hdl->in_use = false;
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function write data to partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  count            bytes to write
 * @param[in] *fpos             file index
 *
 * @retval number of written bytes
 */
//==============================================================================
static ssize_t partition_write(void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);

        struct partition *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(sdspi_data->card_protect_mtx, MAX_DELAY)) {
                n = card_write(sdspi_data, src, count, *fpos + ((u64_t)hdl->first_sector * SECTOR_SIZE));
                mutex_unlock(sdspi_data->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read data from partition file
 *
 * @param[in]  *device_handle   handle to partition description
 * @param[out] *dst             destination
 * @param[in]   count           bytes to read
 * @param[in]  *fpos            file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static ssize_t partition_read(void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);

        struct partition *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(sdspi_data->card_protect_mtx, MAX_DELAY)) {
                n = card_read(sdspi_data, dst, count, *fpos + ((u64_t)hdl->first_sector * SECTOR_SIZE));
                mutex_unlock(sdspi_data->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief Function control partition
 *
 * @param[in]    *device_handle         handle to partition description
 * @param[in]     iorq                  IO request
 * @param[in,out]*arg                   request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_ioctl(void *device_handle, int iorq, void *arg)
{
        STOP_IF(device_handle == NULL);
        UNUSED_ARG(iorq);
        UNUSED_ARG(arg);

        errno = EBADRQC;

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function flush partition
 *
 * @param[in] *device_handle           handle to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_flush(void *device_handle)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function returns device informations
 *
 * @param[in]  *device_handle   driver's memory handle
 * @param[out] *info            device/file info
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_stat(void *device_handle, struct vfs_dev_stat *stat)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(stat == NULL);

        struct partition *hdl = device_handle;
        stat->st_size  = (u64_t)hdl->size_in_sectors * SECTOR_SIZE;
        stat->st_major = 0;
        stat->st_minor = 0;
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function turn on SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_on_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function turn off SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_off_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function send byte by SPI peripheral
 *
 * @param[in] out       data to send
 *
 * @return received byte
 */
//==============================================================================
static u8_t spi_rw(u8_t out)
{
        send_data(out);
        while (!is_Rx_buffer_not_empty());
        return get_data();
}

//==============================================================================
/**
 * @brief Function wait for card ready
 *
 * @return card response
 */
//==============================================================================
static u8_t wait_ready(void)
{
        spi_rw(0xFF);

        u8_t    response;
        timer_t timer = timer_reset();
        while ((response = spi_rw(0xFF)) != 0xFF && !timer_is_expired(timer, SDSPI_WAIT_TIMEOUT));

        return response;
}

//==============================================================================
/**
 * @brief Function transmit command to card
 *
 * @param[in] sdspi     SD SPI interface data
 * @param[in] cmd       card command
 * @param[in] arg       command's argument
 */
//==============================================================================
static u8_t send_cmd(struct sdspi_data *sdspi, u8_t cmd, u32_t arg)
{
        u8_t response;

        /* ACMD<n> is the command sequence of CMD55-CMD<n> */
        if (cmd & 0x80) {
                cmd &= 0x7F;
                response = send_cmd(sdspi, CMD55, 0);
                if (response > 1)
                        return response;
        }

        /* select the card and wait for ready */
        deselect_card();
        select_card();

